###################################################################

# Created by write_sdc on Sun Mar  9 14:17:00 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_load -pin_load 1 [get_ports awready]
set_load -pin_load 1 [get_ports wready]
set_load -pin_load 1 [get_ports arready]
set_load -pin_load 1 [get_ports rvalid]
set_load -pin_load 1 [get_ports {rdata[31]}]
set_load -pin_load 1 [get_ports {rdata[30]}]
set_load -pin_load 1 [get_ports {rdata[29]}]
set_load -pin_load 1 [get_ports {rdata[28]}]
set_load -pin_load 1 [get_ports {rdata[27]}]
set_load -pin_load 1 [get_ports {rdata[26]}]
set_load -pin_load 1 [get_ports {rdata[25]}]
set_load -pin_load 1 [get_ports {rdata[24]}]
set_load -pin_load 1 [get_ports {rdata[23]}]
set_load -pin_load 1 [get_ports {rdata[22]}]
set_load -pin_load 1 [get_ports {rdata[21]}]
set_load -pin_load 1 [get_ports {rdata[20]}]
set_load -pin_load 1 [get_ports {rdata[19]}]
set_load -pin_load 1 [get_ports {rdata[18]}]
set_load -pin_load 1 [get_ports {rdata[17]}]
set_load -pin_load 1 [get_ports {rdata[16]}]
set_load -pin_load 1 [get_ports {rdata[15]}]
set_load -pin_load 1 [get_ports {rdata[14]}]
set_load -pin_load 1 [get_ports {rdata[13]}]
set_load -pin_load 1 [get_ports {rdata[12]}]
set_load -pin_load 1 [get_ports {rdata[11]}]
set_load -pin_load 1 [get_ports {rdata[10]}]
set_load -pin_load 1 [get_ports {rdata[9]}]
set_load -pin_load 1 [get_ports {rdata[8]}]
set_load -pin_load 1 [get_ports {rdata[7]}]
set_load -pin_load 1 [get_ports {rdata[6]}]
set_load -pin_load 1 [get_ports {rdata[5]}]
set_load -pin_load 1 [get_ports {rdata[4]}]
set_load -pin_load 1 [get_ports {rdata[3]}]
set_load -pin_load 1 [get_ports {rdata[2]}]
set_load -pin_load 1 [get_ports {rdata[1]}]
set_load -pin_load 1 [get_ports {rdata[0]}]
set_load -pin_load 1 [get_ports ss_tready]
set_load -pin_load 1 [get_ports sm_tvalid]
set_load -pin_load 1 [get_ports {sm_tdata[31]}]
set_load -pin_load 1 [get_ports {sm_tdata[30]}]
set_load -pin_load 1 [get_ports {sm_tdata[29]}]
set_load -pin_load 1 [get_ports {sm_tdata[28]}]
set_load -pin_load 1 [get_ports {sm_tdata[27]}]
set_load -pin_load 1 [get_ports {sm_tdata[26]}]
set_load -pin_load 1 [get_ports {sm_tdata[25]}]
set_load -pin_load 1 [get_ports {sm_tdata[24]}]
set_load -pin_load 1 [get_ports {sm_tdata[23]}]
set_load -pin_load 1 [get_ports {sm_tdata[22]}]
set_load -pin_load 1 [get_ports {sm_tdata[21]}]
set_load -pin_load 1 [get_ports {sm_tdata[20]}]
set_load -pin_load 1 [get_ports {sm_tdata[19]}]
set_load -pin_load 1 [get_ports {sm_tdata[18]}]
set_load -pin_load 1 [get_ports {sm_tdata[17]}]
set_load -pin_load 1 [get_ports {sm_tdata[16]}]
set_load -pin_load 1 [get_ports {sm_tdata[15]}]
set_load -pin_load 1 [get_ports {sm_tdata[14]}]
set_load -pin_load 1 [get_ports {sm_tdata[13]}]
set_load -pin_load 1 [get_ports {sm_tdata[12]}]
set_load -pin_load 1 [get_ports {sm_tdata[11]}]
set_load -pin_load 1 [get_ports {sm_tdata[10]}]
set_load -pin_load 1 [get_ports {sm_tdata[9]}]
set_load -pin_load 1 [get_ports {sm_tdata[8]}]
set_load -pin_load 1 [get_ports {sm_tdata[7]}]
set_load -pin_load 1 [get_ports {sm_tdata[6]}]
set_load -pin_load 1 [get_ports {sm_tdata[5]}]
set_load -pin_load 1 [get_ports {sm_tdata[4]}]
set_load -pin_load 1 [get_ports {sm_tdata[3]}]
set_load -pin_load 1 [get_ports {sm_tdata[2]}]
set_load -pin_load 1 [get_ports {sm_tdata[1]}]
set_load -pin_load 1 [get_ports {sm_tdata[0]}]
set_load -pin_load 1 [get_ports sm_tlast]
set_load -pin_load 1 [get_ports {tap_WE[3]}]
set_load -pin_load 1 [get_ports {tap_WE[2]}]
set_load -pin_load 1 [get_ports {tap_WE[1]}]
set_load -pin_load 1 [get_ports {tap_WE[0]}]
set_load -pin_load 1 [get_ports tap_EN]
set_load -pin_load 1 [get_ports {tap_Di[31]}]
set_load -pin_load 1 [get_ports {tap_Di[30]}]
set_load -pin_load 1 [get_ports {tap_Di[29]}]
set_load -pin_load 1 [get_ports {tap_Di[28]}]
set_load -pin_load 1 [get_ports {tap_Di[27]}]
set_load -pin_load 1 [get_ports {tap_Di[26]}]
set_load -pin_load 1 [get_ports {tap_Di[25]}]
set_load -pin_load 1 [get_ports {tap_Di[24]}]
set_load -pin_load 1 [get_ports {tap_Di[23]}]
set_load -pin_load 1 [get_ports {tap_Di[22]}]
set_load -pin_load 1 [get_ports {tap_Di[21]}]
set_load -pin_load 1 [get_ports {tap_Di[20]}]
set_load -pin_load 1 [get_ports {tap_Di[19]}]
set_load -pin_load 1 [get_ports {tap_Di[18]}]
set_load -pin_load 1 [get_ports {tap_Di[17]}]
set_load -pin_load 1 [get_ports {tap_Di[16]}]
set_load -pin_load 1 [get_ports {tap_Di[15]}]
set_load -pin_load 1 [get_ports {tap_Di[14]}]
set_load -pin_load 1 [get_ports {tap_Di[13]}]
set_load -pin_load 1 [get_ports {tap_Di[12]}]
set_load -pin_load 1 [get_ports {tap_Di[11]}]
set_load -pin_load 1 [get_ports {tap_Di[10]}]
set_load -pin_load 1 [get_ports {tap_Di[9]}]
set_load -pin_load 1 [get_ports {tap_Di[8]}]
set_load -pin_load 1 [get_ports {tap_Di[7]}]
set_load -pin_load 1 [get_ports {tap_Di[6]}]
set_load -pin_load 1 [get_ports {tap_Di[5]}]
set_load -pin_load 1 [get_ports {tap_Di[4]}]
set_load -pin_load 1 [get_ports {tap_Di[3]}]
set_load -pin_load 1 [get_ports {tap_Di[2]}]
set_load -pin_load 1 [get_ports {tap_Di[1]}]
set_load -pin_load 1 [get_ports {tap_Di[0]}]
set_load -pin_load 1 [get_ports {tap_A[11]}]
set_load -pin_load 1 [get_ports {tap_A[10]}]
set_load -pin_load 1 [get_ports {tap_A[9]}]
set_load -pin_load 1 [get_ports {tap_A[8]}]
set_load -pin_load 1 [get_ports {tap_A[7]}]
set_load -pin_load 1 [get_ports {tap_A[6]}]
set_load -pin_load 1 [get_ports {tap_A[5]}]
set_load -pin_load 1 [get_ports {tap_A[4]}]
set_load -pin_load 1 [get_ports {tap_A[3]}]
set_load -pin_load 1 [get_ports {tap_A[2]}]
set_load -pin_load 1 [get_ports {tap_A[1]}]
set_load -pin_load 1 [get_ports {tap_A[0]}]
set_load -pin_load 1 [get_ports {data_WE[3]}]
set_load -pin_load 1 [get_ports {data_WE[2]}]
set_load -pin_load 1 [get_ports {data_WE[1]}]
set_load -pin_load 1 [get_ports {data_WE[0]}]
set_load -pin_load 1 [get_ports data_EN]
set_load -pin_load 1 [get_ports {data_Di[31]}]
set_load -pin_load 1 [get_ports {data_Di[30]}]
set_load -pin_load 1 [get_ports {data_Di[29]}]
set_load -pin_load 1 [get_ports {data_Di[28]}]
set_load -pin_load 1 [get_ports {data_Di[27]}]
set_load -pin_load 1 [get_ports {data_Di[26]}]
set_load -pin_load 1 [get_ports {data_Di[25]}]
set_load -pin_load 1 [get_ports {data_Di[24]}]
set_load -pin_load 1 [get_ports {data_Di[23]}]
set_load -pin_load 1 [get_ports {data_Di[22]}]
set_load -pin_load 1 [get_ports {data_Di[21]}]
set_load -pin_load 1 [get_ports {data_Di[20]}]
set_load -pin_load 1 [get_ports {data_Di[19]}]
set_load -pin_load 1 [get_ports {data_Di[18]}]
set_load -pin_load 1 [get_ports {data_Di[17]}]
set_load -pin_load 1 [get_ports {data_Di[16]}]
set_load -pin_load 1 [get_ports {data_Di[15]}]
set_load -pin_load 1 [get_ports {data_Di[14]}]
set_load -pin_load 1 [get_ports {data_Di[13]}]
set_load -pin_load 1 [get_ports {data_Di[12]}]
set_load -pin_load 1 [get_ports {data_Di[11]}]
set_load -pin_load 1 [get_ports {data_Di[10]}]
set_load -pin_load 1 [get_ports {data_Di[9]}]
set_load -pin_load 1 [get_ports {data_Di[8]}]
set_load -pin_load 1 [get_ports {data_Di[7]}]
set_load -pin_load 1 [get_ports {data_Di[6]}]
set_load -pin_load 1 [get_ports {data_Di[5]}]
set_load -pin_load 1 [get_ports {data_Di[4]}]
set_load -pin_load 1 [get_ports {data_Di[3]}]
set_load -pin_load 1 [get_ports {data_Di[2]}]
set_load -pin_load 1 [get_ports {data_Di[1]}]
set_load -pin_load 1 [get_ports {data_Di[0]}]
set_load -pin_load 1 [get_ports {data_A[11]}]
set_load -pin_load 1 [get_ports {data_A[10]}]
set_load -pin_load 1 [get_ports {data_A[9]}]
set_load -pin_load 1 [get_ports {data_A[8]}]
set_load -pin_load 1 [get_ports {data_A[7]}]
set_load -pin_load 1 [get_ports {data_A[6]}]
set_load -pin_load 1 [get_ports {data_A[5]}]
set_load -pin_load 1 [get_ports {data_A[4]}]
set_load -pin_load 1 [get_ports {data_A[3]}]
set_load -pin_load 1 [get_ports {data_A[2]}]
set_load -pin_load 1 [get_ports {data_A[1]}]
set_load -pin_load 1 [get_ports {data_A[0]}]
set_max_fanout 6 [get_ports awvalid]
set_max_fanout 6 [get_ports {awaddr[11]}]
set_max_fanout 6 [get_ports {awaddr[10]}]
set_max_fanout 6 [get_ports {awaddr[9]}]
set_max_fanout 6 [get_ports {awaddr[8]}]
set_max_fanout 6 [get_ports {awaddr[7]}]
set_max_fanout 6 [get_ports {awaddr[6]}]
set_max_fanout 6 [get_ports {awaddr[5]}]
set_max_fanout 6 [get_ports {awaddr[4]}]
set_max_fanout 6 [get_ports {awaddr[3]}]
set_max_fanout 6 [get_ports {awaddr[2]}]
set_max_fanout 6 [get_ports {awaddr[1]}]
set_max_fanout 6 [get_ports {awaddr[0]}]
set_max_fanout 6 [get_ports wvalid]
set_max_fanout 6 [get_ports {wdata[31]}]
set_max_fanout 6 [get_ports {wdata[30]}]
set_max_fanout 6 [get_ports {wdata[29]}]
set_max_fanout 6 [get_ports {wdata[28]}]
set_max_fanout 6 [get_ports {wdata[27]}]
set_max_fanout 6 [get_ports {wdata[26]}]
set_max_fanout 6 [get_ports {wdata[25]}]
set_max_fanout 6 [get_ports {wdata[24]}]
set_max_fanout 6 [get_ports {wdata[23]}]
set_max_fanout 6 [get_ports {wdata[22]}]
set_max_fanout 6 [get_ports {wdata[21]}]
set_max_fanout 6 [get_ports {wdata[20]}]
set_max_fanout 6 [get_ports {wdata[19]}]
set_max_fanout 6 [get_ports {wdata[18]}]
set_max_fanout 6 [get_ports {wdata[17]}]
set_max_fanout 6 [get_ports {wdata[16]}]
set_max_fanout 6 [get_ports {wdata[15]}]
set_max_fanout 6 [get_ports {wdata[14]}]
set_max_fanout 6 [get_ports {wdata[13]}]
set_max_fanout 6 [get_ports {wdata[12]}]
set_max_fanout 6 [get_ports {wdata[11]}]
set_max_fanout 6 [get_ports {wdata[10]}]
set_max_fanout 6 [get_ports {wdata[9]}]
set_max_fanout 6 [get_ports {wdata[8]}]
set_max_fanout 6 [get_ports {wdata[7]}]
set_max_fanout 6 [get_ports {wdata[6]}]
set_max_fanout 6 [get_ports {wdata[5]}]
set_max_fanout 6 [get_ports {wdata[4]}]
set_max_fanout 6 [get_ports {wdata[3]}]
set_max_fanout 6 [get_ports {wdata[2]}]
set_max_fanout 6 [get_ports {wdata[1]}]
set_max_fanout 6 [get_ports {wdata[0]}]
set_max_fanout 6 [get_ports rready]
set_max_fanout 6 [get_ports arvalid]
set_max_fanout 6 [get_ports {araddr[11]}]
set_max_fanout 6 [get_ports {araddr[10]}]
set_max_fanout 6 [get_ports {araddr[9]}]
set_max_fanout 6 [get_ports {araddr[8]}]
set_max_fanout 6 [get_ports {araddr[7]}]
set_max_fanout 6 [get_ports {araddr[6]}]
set_max_fanout 6 [get_ports {araddr[5]}]
set_max_fanout 6 [get_ports {araddr[4]}]
set_max_fanout 6 [get_ports {araddr[3]}]
set_max_fanout 6 [get_ports {araddr[2]}]
set_max_fanout 6 [get_ports {araddr[1]}]
set_max_fanout 6 [get_ports {araddr[0]}]
set_max_fanout 6 [get_ports ss_tvalid]
set_max_fanout 6 [get_ports {ss_tdata[31]}]
set_max_fanout 6 [get_ports {ss_tdata[30]}]
set_max_fanout 6 [get_ports {ss_tdata[29]}]
set_max_fanout 6 [get_ports {ss_tdata[28]}]
set_max_fanout 6 [get_ports {ss_tdata[27]}]
set_max_fanout 6 [get_ports {ss_tdata[26]}]
set_max_fanout 6 [get_ports {ss_tdata[25]}]
set_max_fanout 6 [get_ports {ss_tdata[24]}]
set_max_fanout 6 [get_ports {ss_tdata[23]}]
set_max_fanout 6 [get_ports {ss_tdata[22]}]
set_max_fanout 6 [get_ports {ss_tdata[21]}]
set_max_fanout 6 [get_ports {ss_tdata[20]}]
set_max_fanout 6 [get_ports {ss_tdata[19]}]
set_max_fanout 6 [get_ports {ss_tdata[18]}]
set_max_fanout 6 [get_ports {ss_tdata[17]}]
set_max_fanout 6 [get_ports {ss_tdata[16]}]
set_max_fanout 6 [get_ports {ss_tdata[15]}]
set_max_fanout 6 [get_ports {ss_tdata[14]}]
set_max_fanout 6 [get_ports {ss_tdata[13]}]
set_max_fanout 6 [get_ports {ss_tdata[12]}]
set_max_fanout 6 [get_ports {ss_tdata[11]}]
set_max_fanout 6 [get_ports {ss_tdata[10]}]
set_max_fanout 6 [get_ports {ss_tdata[9]}]
set_max_fanout 6 [get_ports {ss_tdata[8]}]
set_max_fanout 6 [get_ports {ss_tdata[7]}]
set_max_fanout 6 [get_ports {ss_tdata[6]}]
set_max_fanout 6 [get_ports {ss_tdata[5]}]
set_max_fanout 6 [get_ports {ss_tdata[4]}]
set_max_fanout 6 [get_ports {ss_tdata[3]}]
set_max_fanout 6 [get_ports {ss_tdata[2]}]
set_max_fanout 6 [get_ports {ss_tdata[1]}]
set_max_fanout 6 [get_ports {ss_tdata[0]}]
set_max_fanout 6 [get_ports ss_tlast]
set_max_fanout 6 [get_ports sm_tready]
set_max_fanout 6 [get_ports {tap_Do[31]}]
set_max_fanout 6 [get_ports {tap_Do[30]}]
set_max_fanout 6 [get_ports {tap_Do[29]}]
set_max_fanout 6 [get_ports {tap_Do[28]}]
set_max_fanout 6 [get_ports {tap_Do[27]}]
set_max_fanout 6 [get_ports {tap_Do[26]}]
set_max_fanout 6 [get_ports {tap_Do[25]}]
set_max_fanout 6 [get_ports {tap_Do[24]}]
set_max_fanout 6 [get_ports {tap_Do[23]}]
set_max_fanout 6 [get_ports {tap_Do[22]}]
set_max_fanout 6 [get_ports {tap_Do[21]}]
set_max_fanout 6 [get_ports {tap_Do[20]}]
set_max_fanout 6 [get_ports {tap_Do[19]}]
set_max_fanout 6 [get_ports {tap_Do[18]}]
set_max_fanout 6 [get_ports {tap_Do[17]}]
set_max_fanout 6 [get_ports {tap_Do[16]}]
set_max_fanout 6 [get_ports {tap_Do[15]}]
set_max_fanout 6 [get_ports {tap_Do[14]}]
set_max_fanout 6 [get_ports {tap_Do[13]}]
set_max_fanout 6 [get_ports {tap_Do[12]}]
set_max_fanout 6 [get_ports {tap_Do[11]}]
set_max_fanout 6 [get_ports {tap_Do[10]}]
set_max_fanout 6 [get_ports {tap_Do[9]}]
set_max_fanout 6 [get_ports {tap_Do[8]}]
set_max_fanout 6 [get_ports {tap_Do[7]}]
set_max_fanout 6 [get_ports {tap_Do[6]}]
set_max_fanout 6 [get_ports {tap_Do[5]}]
set_max_fanout 6 [get_ports {tap_Do[4]}]
set_max_fanout 6 [get_ports {tap_Do[3]}]
set_max_fanout 6 [get_ports {tap_Do[2]}]
set_max_fanout 6 [get_ports {tap_Do[1]}]
set_max_fanout 6 [get_ports {tap_Do[0]}]
set_max_fanout 6 [get_ports {data_Do[31]}]
set_max_fanout 6 [get_ports {data_Do[30]}]
set_max_fanout 6 [get_ports {data_Do[29]}]
set_max_fanout 6 [get_ports {data_Do[28]}]
set_max_fanout 6 [get_ports {data_Do[27]}]
set_max_fanout 6 [get_ports {data_Do[26]}]
set_max_fanout 6 [get_ports {data_Do[25]}]
set_max_fanout 6 [get_ports {data_Do[24]}]
set_max_fanout 6 [get_ports {data_Do[23]}]
set_max_fanout 6 [get_ports {data_Do[22]}]
set_max_fanout 6 [get_ports {data_Do[21]}]
set_max_fanout 6 [get_ports {data_Do[20]}]
set_max_fanout 6 [get_ports {data_Do[19]}]
set_max_fanout 6 [get_ports {data_Do[18]}]
set_max_fanout 6 [get_ports {data_Do[17]}]
set_max_fanout 6 [get_ports {data_Do[16]}]
set_max_fanout 6 [get_ports {data_Do[15]}]
set_max_fanout 6 [get_ports {data_Do[14]}]
set_max_fanout 6 [get_ports {data_Do[13]}]
set_max_fanout 6 [get_ports {data_Do[12]}]
set_max_fanout 6 [get_ports {data_Do[11]}]
set_max_fanout 6 [get_ports {data_Do[10]}]
set_max_fanout 6 [get_ports {data_Do[9]}]
set_max_fanout 6 [get_ports {data_Do[8]}]
set_max_fanout 6 [get_ports {data_Do[7]}]
set_max_fanout 6 [get_ports {data_Do[6]}]
set_max_fanout 6 [get_ports {data_Do[5]}]
set_max_fanout 6 [get_ports {data_Do[4]}]
set_max_fanout 6 [get_ports {data_Do[3]}]
set_max_fanout 6 [get_ports {data_Do[2]}]
set_max_fanout 6 [get_ports {data_Do[1]}]
set_max_fanout 6 [get_ports {data_Do[0]}]
set_max_fanout 6 [get_ports axis_clk]
set_max_fanout 6 [get_ports axis_rst_n]
set_ideal_network [get_ports axis_clk]
create_clock [get_ports axis_clk]  -period 5  -waveform {0 2.5}
set_clock_latency 0.5  [get_clocks axis_clk]
set_clock_uncertainty 0.1  [get_clocks axis_clk]
set_input_delay -clock axis_clk  1  [get_ports awvalid]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[11]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[10]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[9]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[8]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[7]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[6]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[5]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[4]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[3]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[2]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[1]}]
set_input_delay -clock axis_clk  1  [get_ports {awaddr[0]}]
set_input_delay -clock axis_clk  1  [get_ports wvalid]
set_input_delay -clock axis_clk  1  [get_ports {wdata[31]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[30]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[29]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[28]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[27]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[26]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[25]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[24]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[23]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[22]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[21]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[20]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[19]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[18]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[17]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[16]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[15]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[14]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[13]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[12]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[11]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[10]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[9]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[8]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[7]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[6]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[5]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[4]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[3]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[2]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[1]}]
set_input_delay -clock axis_clk  1  [get_ports {wdata[0]}]
set_input_delay -clock axis_clk  1  [get_ports rready]
set_input_delay -clock axis_clk  1  [get_ports arvalid]
set_input_delay -clock axis_clk  1  [get_ports {araddr[11]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[10]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[9]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[8]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[7]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[6]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[5]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[4]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[3]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[2]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[1]}]
set_input_delay -clock axis_clk  1  [get_ports {araddr[0]}]
set_input_delay -clock axis_clk  1  [get_ports ss_tvalid]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[31]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[30]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[29]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[28]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[27]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[26]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[25]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[24]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[23]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[22]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[21]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[20]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[19]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[18]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[17]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[16]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[15]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[14]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[13]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[12]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[11]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[10]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[9]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[8]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[7]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[6]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[5]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[4]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[3]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[2]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[1]}]
set_input_delay -clock axis_clk  1  [get_ports {ss_tdata[0]}]
set_input_delay -clock axis_clk  1  [get_ports ss_tlast]
set_input_delay -clock axis_clk  1  [get_ports sm_tready]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[31]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[30]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[29]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[28]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[27]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[26]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[25]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[24]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[23]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[22]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[21]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[20]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[19]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[18]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[17]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[16]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[15]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[14]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[13]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[12]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[11]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[10]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[9]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[8]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[7]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[6]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[5]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[4]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[3]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[2]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[1]}]
set_input_delay -clock axis_clk  1  [get_ports {tap_Do[0]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[31]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[30]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[29]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[28]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[27]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[26]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[25]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[24]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[23]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[22]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[21]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[20]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[19]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[18]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[17]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[16]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[15]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[14]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[13]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[12]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[11]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[10]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[9]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[8]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[7]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[6]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[5]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[4]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[3]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[2]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[1]}]
set_input_delay -clock axis_clk  1  [get_ports {data_Do[0]}]
set_input_delay -clock axis_clk  1  [get_ports axis_rst_n]
set_output_delay -clock axis_clk  1  [get_ports awready]
set_output_delay -clock axis_clk  1  [get_ports wready]
set_output_delay -clock axis_clk  1  [get_ports arready]
set_output_delay -clock axis_clk  1  [get_ports rvalid]
set_output_delay -clock axis_clk  1  [get_ports {rdata[31]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[30]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[29]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[28]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[27]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[26]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[25]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[24]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[23]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[22]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[21]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[20]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[19]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[18]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[17]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[16]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[15]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[14]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[13]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[12]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[11]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[10]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[9]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[8]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[7]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[6]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[5]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[4]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[3]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[2]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[1]}]
set_output_delay -clock axis_clk  1  [get_ports {rdata[0]}]
set_output_delay -clock axis_clk  1  [get_ports ss_tready]
set_output_delay -clock axis_clk  1  [get_ports sm_tvalid]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[31]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[30]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[29]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[28]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[27]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[26]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[25]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[24]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[23]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[22]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[21]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[20]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[19]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[18]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[17]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[16]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[15]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[14]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[13]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[12]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[11]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[10]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[9]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[8]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[7]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[6]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[5]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[4]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[3]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[2]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[1]}]
set_output_delay -clock axis_clk  1  [get_ports {sm_tdata[0]}]
set_output_delay -clock axis_clk  1  [get_ports sm_tlast]
set_output_delay -clock axis_clk  1  [get_ports {tap_WE[3]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_WE[2]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_WE[1]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_WE[0]}]
set_output_delay -clock axis_clk  1  [get_ports tap_EN]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[31]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[30]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[29]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[28]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[27]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[26]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[25]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[24]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[23]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[22]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[21]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[20]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[19]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[18]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[17]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[16]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[15]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[14]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[13]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[12]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[11]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[10]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[9]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[8]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[7]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[6]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[5]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[4]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[3]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[2]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[1]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_Di[0]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[11]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[10]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[9]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[8]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[7]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[6]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[5]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[4]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[3]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[2]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[1]}]
set_output_delay -clock axis_clk  1  [get_ports {tap_A[0]}]
set_output_delay -clock axis_clk  1  [get_ports {data_WE[3]}]
set_output_delay -clock axis_clk  1  [get_ports {data_WE[2]}]
set_output_delay -clock axis_clk  1  [get_ports {data_WE[1]}]
set_output_delay -clock axis_clk  1  [get_ports {data_WE[0]}]
set_output_delay -clock axis_clk  1  [get_ports data_EN]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[31]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[30]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[29]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[28]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[27]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[26]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[25]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[24]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[23]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[22]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[21]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[20]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[19]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[18]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[17]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[16]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[15]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[14]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[13]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[12]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[11]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[10]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[9]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[8]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[7]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[6]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[5]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[4]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[3]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[2]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[1]}]
set_output_delay -clock axis_clk  1  [get_ports {data_Di[0]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[11]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[10]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[9]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[8]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[7]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[6]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[5]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[4]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[3]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[2]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[1]}]
set_output_delay -clock axis_clk  1  [get_ports {data_A[0]}]
set_drive 1  [get_ports awvalid]
set_drive 1  [get_ports {awaddr[11]}]
set_drive 1  [get_ports {awaddr[10]}]
set_drive 1  [get_ports {awaddr[9]}]
set_drive 1  [get_ports {awaddr[8]}]
set_drive 1  [get_ports {awaddr[7]}]
set_drive 1  [get_ports {awaddr[6]}]
set_drive 1  [get_ports {awaddr[5]}]
set_drive 1  [get_ports {awaddr[4]}]
set_drive 1  [get_ports {awaddr[3]}]
set_drive 1  [get_ports {awaddr[2]}]
set_drive 1  [get_ports {awaddr[1]}]
set_drive 1  [get_ports {awaddr[0]}]
set_drive 1  [get_ports wvalid]
set_drive 1  [get_ports {wdata[31]}]
set_drive 1  [get_ports {wdata[30]}]
set_drive 1  [get_ports {wdata[29]}]
set_drive 1  [get_ports {wdata[28]}]
set_drive 1  [get_ports {wdata[27]}]
set_drive 1  [get_ports {wdata[26]}]
set_drive 1  [get_ports {wdata[25]}]
set_drive 1  [get_ports {wdata[24]}]
set_drive 1  [get_ports {wdata[23]}]
set_drive 1  [get_ports {wdata[22]}]
set_drive 1  [get_ports {wdata[21]}]
set_drive 1  [get_ports {wdata[20]}]
set_drive 1  [get_ports {wdata[19]}]
set_drive 1  [get_ports {wdata[18]}]
set_drive 1  [get_ports {wdata[17]}]
set_drive 1  [get_ports {wdata[16]}]
set_drive 1  [get_ports {wdata[15]}]
set_drive 1  [get_ports {wdata[14]}]
set_drive 1  [get_ports {wdata[13]}]
set_drive 1  [get_ports {wdata[12]}]
set_drive 1  [get_ports {wdata[11]}]
set_drive 1  [get_ports {wdata[10]}]
set_drive 1  [get_ports {wdata[9]}]
set_drive 1  [get_ports {wdata[8]}]
set_drive 1  [get_ports {wdata[7]}]
set_drive 1  [get_ports {wdata[6]}]
set_drive 1  [get_ports {wdata[5]}]
set_drive 1  [get_ports {wdata[4]}]
set_drive 1  [get_ports {wdata[3]}]
set_drive 1  [get_ports {wdata[2]}]
set_drive 1  [get_ports {wdata[1]}]
set_drive 1  [get_ports {wdata[0]}]
set_drive 1  [get_ports rready]
set_drive 1  [get_ports arvalid]
set_drive 1  [get_ports {araddr[11]}]
set_drive 1  [get_ports {araddr[10]}]
set_drive 1  [get_ports {araddr[9]}]
set_drive 1  [get_ports {araddr[8]}]
set_drive 1  [get_ports {araddr[7]}]
set_drive 1  [get_ports {araddr[6]}]
set_drive 1  [get_ports {araddr[5]}]
set_drive 1  [get_ports {araddr[4]}]
set_drive 1  [get_ports {araddr[3]}]
set_drive 1  [get_ports {araddr[2]}]
set_drive 1  [get_ports {araddr[1]}]
set_drive 1  [get_ports {araddr[0]}]
set_drive 1  [get_ports ss_tvalid]
set_drive 1  [get_ports {ss_tdata[31]}]
set_drive 1  [get_ports {ss_tdata[30]}]
set_drive 1  [get_ports {ss_tdata[29]}]
set_drive 1  [get_ports {ss_tdata[28]}]
set_drive 1  [get_ports {ss_tdata[27]}]
set_drive 1  [get_ports {ss_tdata[26]}]
set_drive 1  [get_ports {ss_tdata[25]}]
set_drive 1  [get_ports {ss_tdata[24]}]
set_drive 1  [get_ports {ss_tdata[23]}]
set_drive 1  [get_ports {ss_tdata[22]}]
set_drive 1  [get_ports {ss_tdata[21]}]
set_drive 1  [get_ports {ss_tdata[20]}]
set_drive 1  [get_ports {ss_tdata[19]}]
set_drive 1  [get_ports {ss_tdata[18]}]
set_drive 1  [get_ports {ss_tdata[17]}]
set_drive 1  [get_ports {ss_tdata[16]}]
set_drive 1  [get_ports {ss_tdata[15]}]
set_drive 1  [get_ports {ss_tdata[14]}]
set_drive 1  [get_ports {ss_tdata[13]}]
set_drive 1  [get_ports {ss_tdata[12]}]
set_drive 1  [get_ports {ss_tdata[11]}]
set_drive 1  [get_ports {ss_tdata[10]}]
set_drive 1  [get_ports {ss_tdata[9]}]
set_drive 1  [get_ports {ss_tdata[8]}]
set_drive 1  [get_ports {ss_tdata[7]}]
set_drive 1  [get_ports {ss_tdata[6]}]
set_drive 1  [get_ports {ss_tdata[5]}]
set_drive 1  [get_ports {ss_tdata[4]}]
set_drive 1  [get_ports {ss_tdata[3]}]
set_drive 1  [get_ports {ss_tdata[2]}]
set_drive 1  [get_ports {ss_tdata[1]}]
set_drive 1  [get_ports {ss_tdata[0]}]
set_drive 1  [get_ports ss_tlast]
set_drive 1  [get_ports sm_tready]
set_drive 1  [get_ports {tap_Do[31]}]
set_drive 1  [get_ports {tap_Do[30]}]
set_drive 1  [get_ports {tap_Do[29]}]
set_drive 1  [get_ports {tap_Do[28]}]
set_drive 1  [get_ports {tap_Do[27]}]
set_drive 1  [get_ports {tap_Do[26]}]
set_drive 1  [get_ports {tap_Do[25]}]
set_drive 1  [get_ports {tap_Do[24]}]
set_drive 1  [get_ports {tap_Do[23]}]
set_drive 1  [get_ports {tap_Do[22]}]
set_drive 1  [get_ports {tap_Do[21]}]
set_drive 1  [get_ports {tap_Do[20]}]
set_drive 1  [get_ports {tap_Do[19]}]
set_drive 1  [get_ports {tap_Do[18]}]
set_drive 1  [get_ports {tap_Do[17]}]
set_drive 1  [get_ports {tap_Do[16]}]
set_drive 1  [get_ports {tap_Do[15]}]
set_drive 1  [get_ports {tap_Do[14]}]
set_drive 1  [get_ports {tap_Do[13]}]
set_drive 1  [get_ports {tap_Do[12]}]
set_drive 1  [get_ports {tap_Do[11]}]
set_drive 1  [get_ports {tap_Do[10]}]
set_drive 1  [get_ports {tap_Do[9]}]
set_drive 1  [get_ports {tap_Do[8]}]
set_drive 1  [get_ports {tap_Do[7]}]
set_drive 1  [get_ports {tap_Do[6]}]
set_drive 1  [get_ports {tap_Do[5]}]
set_drive 1  [get_ports {tap_Do[4]}]
set_drive 1  [get_ports {tap_Do[3]}]
set_drive 1  [get_ports {tap_Do[2]}]
set_drive 1  [get_ports {tap_Do[1]}]
set_drive 1  [get_ports {tap_Do[0]}]
set_drive 1  [get_ports {data_Do[31]}]
set_drive 1  [get_ports {data_Do[30]}]
set_drive 1  [get_ports {data_Do[29]}]
set_drive 1  [get_ports {data_Do[28]}]
set_drive 1  [get_ports {data_Do[27]}]
set_drive 1  [get_ports {data_Do[26]}]
set_drive 1  [get_ports {data_Do[25]}]
set_drive 1  [get_ports {data_Do[24]}]
set_drive 1  [get_ports {data_Do[23]}]
set_drive 1  [get_ports {data_Do[22]}]
set_drive 1  [get_ports {data_Do[21]}]
set_drive 1  [get_ports {data_Do[20]}]
set_drive 1  [get_ports {data_Do[19]}]
set_drive 1  [get_ports {data_Do[18]}]
set_drive 1  [get_ports {data_Do[17]}]
set_drive 1  [get_ports {data_Do[16]}]
set_drive 1  [get_ports {data_Do[15]}]
set_drive 1  [get_ports {data_Do[14]}]
set_drive 1  [get_ports {data_Do[13]}]
set_drive 1  [get_ports {data_Do[12]}]
set_drive 1  [get_ports {data_Do[11]}]
set_drive 1  [get_ports {data_Do[10]}]
set_drive 1  [get_ports {data_Do[9]}]
set_drive 1  [get_ports {data_Do[8]}]
set_drive 1  [get_ports {data_Do[7]}]
set_drive 1  [get_ports {data_Do[6]}]
set_drive 1  [get_ports {data_Do[5]}]
set_drive 1  [get_ports {data_Do[4]}]
set_drive 1  [get_ports {data_Do[3]}]
set_drive 1  [get_ports {data_Do[2]}]
set_drive 1  [get_ports {data_Do[1]}]
set_drive 1  [get_ports {data_Do[0]}]
set_drive 1  [get_ports axis_clk]
set_drive 1  [get_ports axis_rst_n]
